stl.org
#+TITLE: Note of STL
#+OPTIONS: toc:2 num:3 H:4 ^:nil pri:t
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="org.css" />


* Snippets
#+BEGIN_SRC c++
std::copy(v.cbegin(), v.cend(), ostream_iterator<int>(cout, ", "));
std::distance(v.begin(), result);
#+END_SRC

* Non-modifying sequence operations
** all_of, any_of, none_of
#+BEGIN_SRC c++
  template <class InputIt, class UnaryPredicate>
  bool all_of(InputIt first, InputIt last, UnaryPredicate p) {
    return std::find_if_not(first, last, p) == last;
  }

  bool any_of(InputIt first, InputIt last, UnaryPredicate p) {
    return std::find_if(first, last, p) != last;
  }

  bool none_of(InputIt first, InputIt last, UnaryPredicate p) {
    return std::find_if(first, last, p) == last;
  }

  std::all_of(v.cbegin(), v.cend(), [](int i) { return i % 2 == 0; });
#+END_SRC
** for_each
#+BEGIN_SRC c++
  template <class InputIt, class UnaryFunction>
  UnaryFunction for_each(InputIt first, InputIt last, UnaryFunction f) {
    for (; first != last; ++first) {
      f(*first);
    }
    return f;
  }
#+END_SRC
** count, count_if
#+BEGIN_SRC c++
  template <class InputIt, class T>
  int count(InputIt first, InputIt last, const T &value) {
    int ret = 0;
    for (; first != last; ++first) {
      if (*first == value) {
        ret++;
      }
    }
    return ret;
  }

  int count_if(InputIt first, InputIt last, UnaryPredicate p);
#+END_SRC
** mismatch
#+BEGIN_SRC c++

  template <class InputIt1, class InputIt2>
  std::pair<InputIt1, InputIt2>
    mismatch(InputIt1 first1, InputIt1 last1, InputIt2 first2) {
    while (first1 != last1 && *first1 == *first2) {
      ++first1, ++first2;
    }
    return std::make_pair(first1, first2);
  }

  std::pair<InputIt1, InputIt2>
    mismatch(InputIt1 first1, InputIt1 last1, InputIt2 first2, BinaryPredicate p);
#+END_SRC
** equal
#+BEGIN_SRC c++
  template <class InputIt1, class InputIt2>
  bool equal(InputIt1 first1, InputIt1 last1, InputIt2 first2) {
    for (; first1 != last1; ++first1, ++first2) {
      if (!(*first1 == *first2)) {
        return false;
      }
    }
    return true;
  }
  bool equal(InputIt1 first1, InputIt1 last1, InputIt2 first2, BinaryPredicate p);
#+END_SRC
** find, find_if, find_if_not
#+BEGIN_SRC c++
  template <class InputIt, class T>
  InputIt find(InputIt first, InputIt last, const T &value) {
    for (; first != last; ++first) {
      if (*first == value) {
        return first;
      }
    }
    return last;
  }
  InputIt find_if(InputIt first, InputIt last, UnaryPredicate p);
  InputIt find_if_not(InputIt first, InputIt last, UnaryPredicate q);
#+END_SRC
** find_end
find last range using =std::search=
#+BEGIN_SRC c++
  std::vector<int> v{1, 2, 3, 4, 1, 2, 3, 4, 1, 2, 3, 4};
  std::vector<int>::iterator result;
  std::vector<int> t1{1, 2, 3};
  result = std::find_end(v.begin(), v.end(), t1.begin(), t1.end());
  // std::distance(v.begin(), result) == 8
#+END_SRC
** find_first_of
find first one of ...
#+BEGIN_SRC c++

  std::vector<int> v{0, 2, 3, 25, 5};
  std::vector<int> t{3, 19, 10, 2};
  auto result = std::find_first_of(v.begin(), v.end(), t.begin(), t.end());
  // *result == 2
#+END_SRC
** adjacent_find
#+BEGIN_SRC c++
  template <class ForwardIt>
  ForwardIt adjacent_find(ForwardIt first, ForwardIt last);
  template <class ForwardIt, class BinaryPredicate>
  ForwardIt adjacent_find(ForwardIt first, ForwardIt last, BinaryPredicate p);

  std::vector<int> v1{0, 1, 2, 3, 40, 40, 41, 41, 5};
  auto i1 = std::adjacent_find(v1.begin(), v1.end());
  // std::distance(v1.begin(), i1) == 4
  auto i2 = std::adjacent_find(v1.begin(), v1.end(), std::greater<int>());
  // std::distance(v1.begin(), i2) == 7
#+END_SRC
** search, search_n
#+BEGIN_SRC c++
  std::string cont = "why waste time learning, when ignorance is instantaneous?";
  std::string s = "learning";
  std::search(cont.begin(), cont.end(), s.begin(), s.end()) != cont.end();
#+END_SRC
=search_n= search for the first sequence of count identical elements.
* Modifying sequence operations
** copy, copy_if
Copy [first, last) into [d_first, ...)
#+BEGIN_SRC c++
  template <class InputIt, class OutputIt>
  OutputIt copy(InputIt first, InputIt last, OutputIt d_first) {
    while (first != last) {
      ,*d_first++ = *first++;
    }
    return d_first;
  }
  OutputIt copy_if(InputIt first, InputIt last, OutputIt d_first,
                   UnaryPredicate pred);
#+END_SRC
