stl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-14 Wed 17:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Note of STL</title>
<meta name="author" content="scturtle" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Note of STL</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge96ace0">1. Snippets</a></li>
<li><a href="#org8a03aeb">2. Non-modifying sequence operations</a>
<ul>
<li><a href="#org34149ac">2.1. all_of, any_of, none_of</a></li>
<li><a href="#orgbffdb71">2.2. for_each</a></li>
<li><a href="#org2969f87">2.3. count, count_if</a></li>
<li><a href="#org527a093">2.4. mismatch</a></li>
<li><a href="#org399f31b">2.5. equal</a></li>
<li><a href="#org0f7b3cf">2.6. find, find_if, find_if_not</a></li>
<li><a href="#orgc2616a8">2.7. find_end</a></li>
<li><a href="#org4b169be">2.8. find_first_of</a></li>
<li><a href="#orgf7403c5">2.9. adjacent_find</a></li>
<li><a href="#org3a0f448">2.10. search, search_n</a></li>
</ul>
</li>
<li><a href="#org9a083aa">3. Modifying sequence operations</a>
<ul>
<li><a href="#orgdef7f50">3.1. copy, copy_if</a></li>
<li><a href="#orgfeb6006">3.2. copy_n</a></li>
<li><a href="#orga89b8fc">3.3. copy_backward</a></li>
<li><a href="#orge374ca5">3.4. move</a></li>
<li><a href="#orga9d1b9b">3.5. move_backward</a></li>
<li><a href="#org038b334">3.6. fill, fill_n</a></li>
<li><a href="#org85b42ba">3.7. transform</a></li>
<li><a href="#org01e4bb8">3.8. generate, generate_n</a></li>
<li><a href="#orgb55ddc0">3.9. remove, remove_if</a></li>
<li><a href="#orgb793090">3.10. remove_copy, remove_copy_if</a></li>
<li><a href="#orgfde6a78">3.11. replace, replace_if</a></li>
<li><a href="#orga2456b3">3.12. replace_copy, replace_copy_if</a></li>
<li><a href="#orgdb24b1d">3.13. swap, swap_ranges, iter_swap</a></li>
<li><a href="#org444508a">3.14. reverse, reverse_copy</a></li>
<li><a href="#org9620c4a">3.15. rotate, rotate_copy</a></li>
<li><a href="#orgfa94991">3.16. random_shuffle, shuffle</a></li>
<li><a href="#org28f8c78">3.17. unique, unique_copy</a></li>
</ul>
</li>
<li><a href="#org2f48d02">4. Partitioning operations</a></li>
<li><a href="#org97d4b10">5. Sorting operations</a></li>
<li><a href="#orge8f2155">6. Binary search operations (on sorted ranges)</a></li>
<li><a href="#org6251f26">7. Set operations (on sorted ranges)</a></li>
<li><a href="#orgb21b84b">8. Heap operations</a></li>
<li><a href="#org61ecf35">9. Minimum/maximum operations</a></li>
<li><a href="#orgd9b7b2a">10. Numeric operations (&lt;numeric&gt;)</a></li>
<li><a href="#orgf262184">11. C library (&lt;cstdlib&gt;)</a></li>
</ul>
</div>
</div>


<div id="outline-container-orge96ace0" class="outline-2">
<h2 id="orge96ace0"><span class="section-number-2">1.</span> Snippets</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-c++">std::copy(v.cbegin(), v.cend(), ostream_iterator&lt;int&gt;(cout, ", "));
std::distance(v.begin(), result);
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a03aeb" class="outline-2">
<h2 id="org8a03aeb"><span class="section-number-2">2.</span> Non-modifying sequence operations</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org34149ac" class="outline-3">
<h3 id="org34149ac"><span class="section-number-3">2.1.</span> all_of, any_of, none_of</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class InputIt, class UnaryPredicate&gt;
  bool all_of(InputIt first, InputIt last, UnaryPredicate p) {
    return std::find_if_not(first, last, p) == last;
  }

  bool any_of(InputIt first, InputIt last, UnaryPredicate p) {
    return std::find_if(first, last, p) != last;
  }

  bool none_of(InputIt first, InputIt last, UnaryPredicate p) {
    return std::find_if(first, last, p) == last;
  }

  std::all_of(v.cbegin(), v.cend(), [](int i) { return i % 2 == 0; });
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbffdb71" class="outline-3">
<h3 id="orgbffdb71"><span class="section-number-3">2.2.</span> for_each</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class InputIt, class UnaryFunction&gt;
  UnaryFunction for_each(InputIt first, InputIt last, UnaryFunction f) {
    for (; first != last; ++first) {
      f(*first);
    }
    return f;
  }
</pre>
</div>
</div>
</div>
<div id="outline-container-org2969f87" class="outline-3">
<h3 id="org2969f87"><span class="section-number-3">2.3.</span> count, count_if</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class InputIt, class T&gt;
  int count(InputIt first, InputIt last, const T &amp;value) {
    int ret = 0;
    for (; first != last; ++first) {
      if (*first == value) {
        ret++;
      }
    }
    return ret;
  }

  int count_if(InputIt first, InputIt last, UnaryPredicate p);
</pre>
</div>
</div>
</div>
<div id="outline-container-org527a093" class="outline-3">
<h3 id="org527a093"><span class="section-number-3">2.4.</span> mismatch</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-c++">
  template &lt;class InputIt1, class InputIt2&gt;
  std::pair&lt;InputIt1, InputIt2&gt;
    mismatch(InputIt1 first1, InputIt1 last1, InputIt2 first2) {
    while (first1 != last1 &amp;&amp; *first1 == *first2) {
      ++first1, ++first2;
    }
    return std::make_pair(first1, first2);
  }

  std::pair&lt;InputIt1, InputIt2&gt;
    mismatch(InputIt1 first1, InputIt1 last1, InputIt2 first2, BinaryPredicate p);
</pre>
</div>
</div>
</div>
<div id="outline-container-org399f31b" class="outline-3">
<h3 id="org399f31b"><span class="section-number-3">2.5.</span> equal</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class InputIt1, class InputIt2&gt;
  bool equal(InputIt1 first1, InputIt1 last1, InputIt2 first2) {
    for (; first1 != last1; ++first1, ++first2) {
      if (!(*first1 == *first2)) {
        return false;
      }
    }
    return true;
  }
  bool equal(InputIt1 first1, InputIt1 last1, InputIt2 first2, BinaryPredicate p);
</pre>
</div>
</div>
</div>
<div id="outline-container-org0f7b3cf" class="outline-3">
<h3 id="org0f7b3cf"><span class="section-number-3">2.6.</span> find, find_if, find_if_not</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class InputIt, class T&gt;
  InputIt find(InputIt first, InputIt last, const T &amp;value) {
    for (; first != last; ++first) {
      if (*first == value) {
        return first;
      }
    }
    return last;
  }
  InputIt find_if(InputIt first, InputIt last, UnaryPredicate p);
  InputIt find_if_not(InputIt first, InputIt last, UnaryPredicate q);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc2616a8" class="outline-3">
<h3 id="orgc2616a8"><span class="section-number-3">2.7.</span> find_end</h3>
<div class="outline-text-3" id="text-2-7">
<p>
find last range using <code>std::search</code>
</p>
<div class="org-src-container">
<pre class="src src-c++">  std::vector&lt;int&gt; v{1, 2, 3, 4, 1, 2, 3, 4, 1, 2, 3, 4};
  std::vector&lt;int&gt;::iterator result;
  std::vector&lt;int&gt; t1{1, 2, 3};
  result = std::find_end(v.begin(), v.end(), t1.begin(), t1.end());
  // std::distance(v.begin(), result) == 8
</pre>
</div>
</div>
</div>
<div id="outline-container-org4b169be" class="outline-3">
<h3 id="org4b169be"><span class="section-number-3">2.8.</span> find_first_of</h3>
<div class="outline-text-3" id="text-2-8">
<p>
find first one of &#x2026;
</p>
<div class="org-src-container">
<pre class="src src-c++">
  std::vector&lt;int&gt; v{0, 2, 3, 25, 5};
  std::vector&lt;int&gt; t{3, 19, 10, 2};
  auto result = std::find_first_of(v.begin(), v.end(), t.begin(), t.end());
  // *result == 2
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf7403c5" class="outline-3">
<h3 id="orgf7403c5"><span class="section-number-3">2.9.</span> adjacent_find</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class ForwardIt&gt;
  ForwardIt adjacent_find(ForwardIt first, ForwardIt last);
  template &lt;class ForwardIt, class BinaryPredicate&gt;
  ForwardIt adjacent_find(ForwardIt first, ForwardIt last, BinaryPredicate p);

  std::vector&lt;int&gt; v1{0, 1, 2, 3, 40, 40, 41, 41, 5};
  auto i1 = std::adjacent_find(v1.begin(), v1.end());
  // std::distance(v1.begin(), i1) == 4
  auto i2 = std::adjacent_find(v1.begin(), v1.end(), std::greater&lt;int&gt;());
  // std::distance(v1.begin(), i2) == 7
</pre>
</div>
</div>
</div>
<div id="outline-container-org3a0f448" class="outline-3">
<h3 id="org3a0f448"><span class="section-number-3">2.10.</span> search, search_n</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">
<pre class="src src-c++">  std::string cont = "why waste time learning, when ignorance is instantaneous?";
  std::string s = "learning";
  std::search(cont.begin(), cont.end(), s.begin(), s.end()) != cont.end();
</pre>
</div>
<p>
<code>search_n</code> search for the first sequence of count identical elements.
</p>
</div>
</div>
</div>
<div id="outline-container-org9a083aa" class="outline-2">
<h2 id="org9a083aa"><span class="section-number-2">3.</span> Modifying sequence operations</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgdef7f50" class="outline-3">
<h3 id="orgdef7f50"><span class="section-number-3">3.1.</span> copy, copy_if</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Copy [first, last) into [d_first, &#x2026;)
</p>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class InputIt, class OutputIt&gt;
  OutputIt copy(InputIt first, InputIt last, OutputIt d_first) {
    while (first != last) {
      *d_first++ = *first++;
    }
    return d_first;
  }
  OutputIt copy_if(InputIt first, InputIt last, OutputIt d_first,
                   UnaryPredicate pred);
</pre>
</div>
</div>
</div>
