stl.org
** copy_n
copy n elements start from =first= to =result=.
#+BEGIN_SRC c++
  template <class InputIt, class Size, class OutputIt>
  OutputIt copy_n(InputIt first, Size count, OutputIt result) {
    if (count > 0) {
      ,*result++ = *first;
      for (Size i = 1; i < count; ++i) {
        ,*result++ = *++first;
      }
    }
    return result;
  }
#+END_SRC
** copy_backward
Copy (last, first] into (..., d_first]
#+BEGIN_SRC c++
  template <class BidirIt1, class BidirIt2>
  BidirIt2 copy_backward(BidirIt1 first, BidirIt1 last, BidirIt2 d_last) {
    while (first != last) {
      ,*(--d_last) = *(--last);
    }
    return d_last;
  }
#+END_SRC
** move
batch =move=, not really delete those in [first, last)
#+BEGIN_SRC c++
  template <class InputIt, class OutputIt>
  OutputIt move(InputIt first, InputIt last, OutputIt d_first) {
    while (first != last) {
      ,*d_first++ = std::move(*first++);
    }
    return d_first;
  }
#+END_SRC
** move_backward
same as =copy_backward=
** fill, fill_n
#+BEGIN_SRC c++
  template <class ForwardIt, class T>
  void fill(ForwardIt first, ForwardIt last, const T &value) {
    for (; first != last; ++first) {
      ,*first = value;
    }
  }
  OutputIt fill_n(OutputIt first, Size count, const T &value);
#+END_SRC
** transform
applies a function to a range of elements
#+BEGIN_SRC c++


  template <class InputIt, class OutputIt, class UnaryOperation>
  OutputIt transform(InputIt first1, InputIt last1, OutputIt d_first,
                     UnaryOperation unary_op) {
    while (first1 != last1) {
      ,*d_first++ = unary_op(*first1++);
    }
    return d_first;
  }
  OutputIt transform(InputIt1 first1, InputIt1 last1, InputIt2 first2,
                     OutputIt d_first, BinaryOperation binary_op);
#+END_SRC
** generate, generate_n
saves the result of a function in a range
saves the result of N applications of a function
#+BEGIN_SRC c++
  template <class ForwardIt, class Generator>
  void generate(ForwardIt first, ForwardIt last, Generator g) {
    while (first != last) {
      ,*first++ = g();
    }
  }
  OutputIt generate_n(OutputIt first, Size count, Generator g);
#+END_SRC
** remove, remove_if
Removes all elements satisfying specific criteria from the range [first, last).
Returns a past-the-end iterator for the new end of the range.
Done by *shifting*.
#+BEGIN_SRC c++
  template <class ForwardIt, class T>
  ForwardIt remove(ForwardIt first, ForwardIt last, const T &value) {
    first = std::find(first, last, value);
    if (first != last)
      for (ForwardIt i = first; ++i != last;)
        if (!(*i == value))
          *first++ = std::move(*i);
    return first;
  }
  ForwardIt remove_if(ForwardIt first, ForwardIt last, UnaryPredicate p);

  std::string str1 = "Text with some   spaces";
  str1.erase(std::remove(str1.begin(), str1.end(), ' '), str1.end());
#+END_SRC
** remove_copy, remove_copy_if
copy and omit some
** replace, replace_if
#+BEGIN_SRC c++
  template <class ForwardIt, class T>
  void replace(ForwardIt first, ForwardIt last, const T &old_value,
               const T &new_value) {
    for (; first != last; ++first) {
      if (*first == old_value) {
        ,*first = new_value;
      }
    }
  }
  void replace_if(ForwardIt first, ForwardIt last, UnaryPredicate p,
                  const T &new_value);
#+END_SRC
** replace_copy, replace_copy_if
copy and replace some
** swap, swap_ranges, iter_swap
Swaps value / *container* a and b.
#+BEGIN_SRC c++
  int a = 5, b = 3;
  std::swap(a, b);
#+END_SRC
#+BEGIN_SRC c++
  template <class ForwardIt1, class ForwardIt2>
  void iter_swap(ForwardIt1 a, ForwardIt2 b) {
    using std::swap;
    swap(*a, *b);
  }
  template <class ForwardIt1, class ForwardIt2>
  ForwardIt2 swap_ranges(ForwardIt1 first1, ForwardIt1 last1, ForwardIt2 first2) {
    while (first1 != last1) {
      std::iter_swap(first1++, first2++);
    }
    return first2;
  }
#+END_SRC
** reverse, reverse_copy
just use *swap* on bidirectional iterators
#+BEGIN_SRC c++
  template <class BidirIt> void reverse(BidirIt first, BidirIt last) {
    while ((first != last) && (first != --last)) {
      std::iter_swap(first++, last);
    }
  }
  template <class BidirIt, class OutputIt>
  OutputIt reverse_copy(BidirIt first, BidirIt last, OutputIt d_first) {
    while (first != last) {
      ,*(d_first++) = *(--last);
    }
    return d_first;
  }
#+END_SRC
** rotate, rotate_copy
#+BEGIN_SRC c++
  template <class ForwardIt>
  ForwardIt rotate(ForwardIt first, ForwardIt n_first, ForwardIt last) {
    ForwardIt next = n_first;
    while (first != next) {
      std::iter_swap(first++, next++);
      if (next == last) {
        next = n_first;
      } else if (first == n_first) {
        n_first = next;
      }
    }
    return next;
  }

  std::vector<int> v{2, 4, 2, 0, 5, 10, 7, 3, 7, 1};
  // simple rotation to the left
  std::rotate(v.begin(), v.begin() + 1, v.end());
  // simple rotation to the right
  std::rotate(v.rbegin(), v.rbegin() + 1, v.rend());
  // insertion sort
  for (auto i = v.begin(); i != v.end(); ++i) {
    std::rotate(std::upper_bound(v.begin(), i, *i), i, i + 1);
  }
#+END_SRC
** random_shuffle, shuffle
#+BEGIN_SRC c++
  template <class RandomIt> void random_shuffle(RandomIt first, RandomIt last) {
    typename std::iterator_traits<RandomIt>::difference_type i, n;
    n = last - first;
    for (i = n - 1; i > 0; --i) {
      using std::swap;
      swap(first[i], first[std::rand() % (i + 1)]);
    }
  }
#+END_SRC
** unique, unique_copy
Removes all *consecutive duplicate elements* from the range [first, last).
Returns a past-the-end iterator for the new logical end of the range.
#+BEGIN_SRC c++
  template <class ForwardIt> ForwardIt unique(ForwardIt first, ForwardIt last) {
    if (first == last)
      return last;
    ForwardIt result = first;
    while (++first != last) {
      if (!(*result == *first) && ++result != first) {
        ,*result = std::move(*first);
      }
    }
    return ++result;
  }
#+END_SRC
