stl.html
<div id="outline-container-orgfeb6006" class="outline-3">
<h3 id="orgfeb6006"><span class="section-number-3">3.2.</span> copy_n</h3>
<div class="outline-text-3" id="text-3-2">
<p>
copy n elements start from <code>first</code> to <code>result</code>.
</p>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class InputIt, class Size, class OutputIt&gt;
  OutputIt copy_n(InputIt first, Size count, OutputIt result) {
    if (count &gt; 0) {
      *result++ = *first;
      for (Size i = 1; i &lt; count; ++i) {
        *result++ = *++first;
      }
    }
    return result;
  }
</pre>
</div>
</div>
</div>
<div id="outline-container-orga89b8fc" class="outline-3">
<h3 id="orga89b8fc"><span class="section-number-3">3.3.</span> copy_backward</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Copy (last, first] into (&#x2026;, d_first]
</p>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class BidirIt1, class BidirIt2&gt;
  BidirIt2 copy_backward(BidirIt1 first, BidirIt1 last, BidirIt2 d_last) {
    while (first != last) {
      *(--d_last) = *(--last);
    }
    return d_last;
  }
</pre>
</div>
</div>
</div>
<div id="outline-container-orge374ca5" class="outline-3">
<h3 id="orge374ca5"><span class="section-number-3">3.4.</span> move</h3>
<div class="outline-text-3" id="text-3-4">
<p>
batch <code>move</code>, not really delete those in [first, last)
</p>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class InputIt, class OutputIt&gt;
  OutputIt move(InputIt first, InputIt last, OutputIt d_first) {
    while (first != last) {
      *d_first++ = std::move(*first++);
    }
    return d_first;
  }
</pre>
</div>
</div>
</div>
<div id="outline-container-orga9d1b9b" class="outline-3">
<h3 id="orga9d1b9b"><span class="section-number-3">3.5.</span> move_backward</h3>
<div class="outline-text-3" id="text-3-5">
<p>
same as <code>copy_backward</code>
</p>
</div>
</div>
<div id="outline-container-org038b334" class="outline-3">
<h3 id="org038b334"><span class="section-number-3">3.6.</span> fill, fill_n</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class ForwardIt, class T&gt;
  void fill(ForwardIt first, ForwardIt last, const T &amp;value) {
    for (; first != last; ++first) {
      *first = value;
    }
  }
  OutputIt fill_n(OutputIt first, Size count, const T &amp;value);
</pre>
</div>
</div>
</div>
<div id="outline-container-org85b42ba" class="outline-3">
<h3 id="org85b42ba"><span class="section-number-3">3.7.</span> transform</h3>
<div class="outline-text-3" id="text-3-7">
<p>
applies a function to a range of elements
</p>
<div class="org-src-container">
<pre class="src src-c++">

  template &lt;class InputIt, class OutputIt, class UnaryOperation&gt;
  OutputIt transform(InputIt first1, InputIt last1, OutputIt d_first,
                     UnaryOperation unary_op) {
    while (first1 != last1) {
      *d_first++ = unary_op(*first1++);
    }
    return d_first;
  }
  OutputIt transform(InputIt1 first1, InputIt1 last1, InputIt2 first2,
                     OutputIt d_first, BinaryOperation binary_op);
</pre>
</div>
</div>
</div>
<div id="outline-container-org01e4bb8" class="outline-3">
<h3 id="org01e4bb8"><span class="section-number-3">3.8.</span> generate, generate_n</h3>
<div class="outline-text-3" id="text-3-8">
<p>
saves the result of a function in a range
saves the result of N applications of a function
</p>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class ForwardIt, class Generator&gt;
  void generate(ForwardIt first, ForwardIt last, Generator g) {
    while (first != last) {
      *first++ = g();
    }
  }
  OutputIt generate_n(OutputIt first, Size count, Generator g);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb55ddc0" class="outline-3">
<h3 id="orgb55ddc0"><span class="section-number-3">3.9.</span> remove, remove_if</h3>
<div class="outline-text-3" id="text-3-9">
<p>
Removes all elements satisfying specific criteria from the range [first, last).
Returns a past-the-end iterator for the new end of the range.
Done by <b>shifting</b>.
</p>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class ForwardIt, class T&gt;
  ForwardIt remove(ForwardIt first, ForwardIt last, const T &amp;value) {
    first = std::find(first, last, value);
    if (first != last)
      for (ForwardIt i = first; ++i != last;)
        if (!(*i == value))
          *first++ = std::move(*i);
    return first;
  }
  ForwardIt remove_if(ForwardIt first, ForwardIt last, UnaryPredicate p);

  std::string str1 = "Text with some   spaces";
  str1.erase(std::remove(str1.begin(), str1.end(), ' '), str1.end());
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb793090" class="outline-3">
<h3 id="orgb793090"><span class="section-number-3">3.10.</span> remove_copy, remove_copy_if</h3>
<div class="outline-text-3" id="text-3-10">
<p>
copy and omit some
</p>
</div>
</div>
<div id="outline-container-orgfde6a78" class="outline-3">
<h3 id="orgfde6a78"><span class="section-number-3">3.11.</span> replace, replace_if</h3>
<div class="outline-text-3" id="text-3-11">
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class ForwardIt, class T&gt;
  void replace(ForwardIt first, ForwardIt last, const T &amp;old_value,
               const T &amp;new_value) {
    for (; first != last; ++first) {
      if (*first == old_value) {
        *first = new_value;
      }
    }
  }
  void replace_if(ForwardIt first, ForwardIt last, UnaryPredicate p,
                  const T &amp;new_value);
</pre>
</div>
</div>
</div>
<div id="outline-container-orga2456b3" class="outline-3">
<h3 id="orga2456b3"><span class="section-number-3">3.12.</span> replace_copy, replace_copy_if</h3>
<div class="outline-text-3" id="text-3-12">
<p>
copy and replace some
</p>
</div>
</div>
<div id="outline-container-orgdb24b1d" class="outline-3">
<h3 id="orgdb24b1d"><span class="section-number-3">3.13.</span> swap, swap_ranges, iter_swap</h3>
<div class="outline-text-3" id="text-3-13">
<p>
Swaps value / <b>container</b> a and b.
</p>
<div class="org-src-container">
<pre class="src src-c++">  int a = 5, b = 3;
  std::swap(a, b);
</pre>
</div>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class ForwardIt1, class ForwardIt2&gt;
  void iter_swap(ForwardIt1 a, ForwardIt2 b) {
    using std::swap;
    swap(*a, *b);
  }
  template &lt;class ForwardIt1, class ForwardIt2&gt;
  ForwardIt2 swap_ranges(ForwardIt1 first1, ForwardIt1 last1, ForwardIt2 first2) {
    while (first1 != last1) {
      std::iter_swap(first1++, first2++);
    }
    return first2;
  }
</pre>
</div>
</div>
</div>
<div id="outline-container-org444508a" class="outline-3">
<h3 id="org444508a"><span class="section-number-3">3.14.</span> reverse, reverse_copy</h3>
<div class="outline-text-3" id="text-3-14">
<p>
just use <b>swap</b> on bidirectional iterators
</p>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class BidirIt&gt; void reverse(BidirIt first, BidirIt last) {
    while ((first != last) &amp;&amp; (first != --last)) {
      std::iter_swap(first++, last);
    }
  }
  template &lt;class BidirIt, class OutputIt&gt;
  OutputIt reverse_copy(BidirIt first, BidirIt last, OutputIt d_first) {
    while (first != last) {
      *(d_first++) = *(--last);
    }
    return d_first;
  }
</pre>
</div>
</div>
</div>
<div id="outline-container-org9620c4a" class="outline-3">
<h3 id="org9620c4a"><span class="section-number-3">3.15.</span> rotate, rotate_copy</h3>
<div class="outline-text-3" id="text-3-15">
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class ForwardIt&gt;
  ForwardIt rotate(ForwardIt first, ForwardIt n_first, ForwardIt last) {
    ForwardIt next = n_first;
    while (first != next) {
      std::iter_swap(first++, next++);
      if (next == last) {
        next = n_first;
      } else if (first == n_first) {
        n_first = next;
      }
    }
    return next;
  }

  std::vector&lt;int&gt; v{2, 4, 2, 0, 5, 10, 7, 3, 7, 1};
  // simple rotation to the left
  std::rotate(v.begin(), v.begin() + 1, v.end());
  // simple rotation to the right
  std::rotate(v.rbegin(), v.rbegin() + 1, v.rend());
  // insertion sort
  for (auto i = v.begin(); i != v.end(); ++i) {
    std::rotate(std::upper_bound(v.begin(), i, *i), i, i + 1);
  }
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfa94991" class="outline-3">
<h3 id="orgfa94991"><span class="section-number-3">3.16.</span> random_shuffle, shuffle</h3>
<div class="outline-text-3" id="text-3-16">
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class RandomIt&gt; void random_shuffle(RandomIt first, RandomIt last) {
    typename std::iterator_traits&lt;RandomIt&gt;::difference_type i, n;
    n = last - first;
    for (i = n - 1; i &gt; 0; --i) {
      using std::swap;
      swap(first[i], first[std::rand() % (i + 1)]);
    }
  }
</pre>
</div>
</div>
</div>
<div id="outline-container-org28f8c78" class="outline-3">
<h3 id="org28f8c78"><span class="section-number-3">3.17.</span> unique, unique_copy</h3>
<div class="outline-text-3" id="text-3-17">
<p>
Removes all <b>consecutive duplicate elements</b> from the range [first, last).
Returns a past-the-end iterator for the new logical end of the range.
</p>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class ForwardIt&gt; ForwardIt unique(ForwardIt first, ForwardIt last) {
    if (first == last)
      return last;
    ForwardIt result = first;
    while (++first != last) {
      if (!(*result == *first) &amp;&amp; ++result != first) {
        *result = std::move(*first);
      }
    }
    return ++result;
  }
</pre>
</div>
</div>
</div>
</div>
