stl.org
* Partitioning operations
#+BEGIN_SRC c++
  template <class BidirIt, class UnaryPredicate>
  BidirIt partition(BidirIt first, BidirIt last, UnaryPredicate p) {
    while (1) {
      while ((first != last) && p(*first)) {
        ++first;
      }
      if (first == last--)
        break;
      while ((first != last) && !p(*last)) {
        --last;
      }
      if (first == last)
        break;
      std::iter_swap(first++, last);
    }
    return first;
  }
  bool is_partitioned(InputIt first, InputIt last, UnaryPredicate p);
  BidirIt stable_partition(BidirIt first, BidirIt last, UnaryPredicate p);
  ForwardIt partition_point(ForwardIt first, ForwardIt last, UnaryPredicate p);
#+END_SRC
* Sorting operations
#+BEGIN_SRC c++

  // reverse sort
  std::sort(s.begin(), s.end(), std::greater<int>());
  std::sort(s.begin(), s.end(), [](int a, int b) { return b < a; });
  // partial sort
  std::array<int, 10> s{5, 7, 4, 2, 8, 6, 1, 9, 0, 3};
  std::partial_sort(s.begin(), s.begin() + 3, s.end());
  // n-th element
  std::vector<int> v{5, 6, 4, 3, 2, 6, 7, 9, 3};
  std::nth_element(v.begin(), v.begin() + v.size() / 2, v.end());
  // others
  bool is_sorted(ForwardIt first, ForwardIt last);
  void stable_sort(RandomIt first, RandomIt last);
#+END_SRC
* Binary search operations (on sorted ranges)
#+BEGIN_SRC c++
  bool binary_search(ForwardIt first, ForwardIt last, const T &value);
  // the first that is no less than
  ForwardIt lower_bound(ForwardIt first, ForwardIt last, const T &value);
  // the first that is greater than
  ForwardIt lower_bound(ForwardIt first, ForwardIt last, const T &value);
  // range containing all elements equivalent to value
  std::pair<ForwardIt,ForwardIt>
    equal_range( ForwardIt first, ForwardIt last, const T& value );
#+END_SRC
* Set operations (on sorted ranges)
just copy
#+BEGIN_SRC c++
  OutputIt merge(InputIt1 first1, InputIt1 last1,
                 InputIt2 first2, InputIt2 last2, OutputIt d_first);
  void inplace_merge(BidirIt first, BidirIt middle, BidirIt last);
  // if [first1, last1) includes all elms in [first2, last2)
  bool includes(InputIt1 first1, InputIt1 last1, InputIt2 first2, InputIt2 last2);
  // [first1, last1) - [first2, last2)
  OutputIt set_difference(InputIt1 first1, InputIt1 last1,
                          InputIt2 first2, InputIt2 last2, OutputIt d_first);
  // [first1, last1) & [first2, last2)
  OutputIt set_intersection(InputIt1 first1, InputIt1 last1,
                            InputIt2 first2, InputIt2 last2, OutputIt d_first);
  // in either of the ranges, but not in both of them
  OutputIt set_symmetric_difference(InputIt1 first1, InputIt1 last1,
                                    InputIt2 first2, InputIt2 last2,
                                    OutputIt d_first);
  // in both, without duplicates
  OutputIt set_union(InputIt1 first1, InputIt1 last1,
                     InputIt2 first2, InputIt2 last2, OutputIt d_first);
#+END_SRC
* Heap operations
the default is a max heap
#+BEGIN_SRC c++
  bool is_heap(RandomIt first, RandomIt last);
  void make_heap(RandomIt first, RandomIt last);
  // insert the elem at last-1 into the max heap [first, last-1)
  void push_heap(RandomIt first, RandomIt last);
  // that elem is at position last-1 now
  void pop_heap(RandomIt first, RandomIt last);
  // max heap to sorted range
  void sort_heap(RandomIt first, RandomIt last);
#+END_SRC
* Minimum/maximum operations
#+BEGIN_SRC c++
  const T &max(const T &a, const T &b);
  T max(std::initializer_list<T> ilist);
  ForwardIt max_element(ForwardIt first, ForwardIt last);

  std::pair<const T &, const T &> minmax(const T &a, const T &b);
  std::pair<T, T> minmax(std::initializer_list<T> ilist);
  std::pair<ForwardIt, ForwardIt> minmax_element(ForwardIt first, ForwardIt last);
#+END_SRC

string/list compasion
#+BEGIN_SRC c++
  bool lexicographical_compare(InputIt1 first1, InputIt1 last1,
                               InputIt2 first2, InputIt2 last2);
#+END_SRC

permutation
#+BEGIN_SRC c++
  // if [first1, last1) is a permutation of [first2,last2)
  bool is_permutation(ForwardIt1 first1, ForwardIt1 last1, ForwardIt2 first2);

  bool next_permutation(BidirIt first, BidirIt last);
  bool prev_permutation(BidirIt first, BidirIt last);
#+END_SRC
* Numeric operations (<numeric>)
range()
#+BEGIN_SRC c++
  std::list<int> l(10);
  std::iota(l.begin(), l.end(), -4);
  // -4 -3 -2 -1 0 1 2 3 4 5
#+END_SRC

sum()
#+BEGIN_SRC c++
  T accumulate(InputIt first, InputIt last, T init);
#+END_SRC

inner_product, adjacent_difference, partial_sum
* C library (<cstdlib>)
1. ptr - pointer to the array to sort
2. count - number of elements in the array
3. size - size of each element in the array in bytes
4. comp - comparison function which returns ​a
   *negative integer value if the first argument is less than the second*,
   *a positive integer value if the first argument is greater than the second*
   *and zero if the arguments are equal*.

#+BEGIN_SRC c++
  void qsort(void *ptr, std::size_t count, std::size_t size,
             int (*comp)(const void *, const void *));

  int a[] = {-2, 99, 0, -743, 2, INT_MIN, 4};
  constexpr std::size_t size = sizeof a / sizeof *a;

  std::qsort(a, size, sizeof *a, [](const void *a, const void *b) {
    int arg1 = *static_cast<const int *>(a);
    int arg2 = *static_cast<const int *>(b);
    if (arg1 < arg2) return -1;
    if (arg1 > arg2) return 1;
    return 0;
    // return (arg1 > arg2) - (arg1 < arg2); // possible shortcut
    // return arg1 - arg2; // erroneous shortcut (fails if INT_MIN is present)
  });
#+END_SRC

#+BEGIN_SRC c++
  void *bsearch(const void *key, const void *ptr, std::size_t count,
                std::size_t size, int (*comp)(const void *, const void *));

  const int SIZE = 8; int key1 = 4;
  int arr[SIZE] = {1, 2, 3, 4, 5, 6, 7, 8};
  int *p1 = (int *)std::bsearch(&key1, arr, SIZE, sizeof(arr[0]), compare);
#+END_SRC
