stl.html
<div id="outline-container-org2f48d02" class="outline-2">
<h2 id="org2f48d02"><span class="section-number-2">4.</span> Partitioning operations</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-c++">  template &lt;class BidirIt, class UnaryPredicate&gt;
  BidirIt partition(BidirIt first, BidirIt last, UnaryPredicate p) {
    while (1) {
      while ((first != last) &amp;&amp; p(*first)) {
        ++first;
      }
      if (first == last--)
        break;
      while ((first != last) &amp;&amp; !p(*last)) {
        --last;
      }
      if (first == last)
        break;
      std::iter_swap(first++, last);
    }
    return first;
  }
  bool is_partitioned(InputIt first, InputIt last, UnaryPredicate p);
  BidirIt stable_partition(BidirIt first, BidirIt last, UnaryPredicate p);
  ForwardIt partition_point(ForwardIt first, ForwardIt last, UnaryPredicate p);
</pre>
</div>
</div>
</div>
<div id="outline-container-org97d4b10" class="outline-2">
<h2 id="org97d4b10"><span class="section-number-2">5.</span> Sorting operations</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-c++">
  // reverse sort
  std::sort(s.begin(), s.end(), std::greater&lt;int&gt;());
  std::sort(s.begin(), s.end(), [](int a, int b) { return b &lt; a; });
  // partial sort
  std::array&lt;int, 10&gt; s{5, 7, 4, 2, 8, 6, 1, 9, 0, 3};
  std::partial_sort(s.begin(), s.begin() + 3, s.end());
  // n-th element
  std::vector&lt;int&gt; v{5, 6, 4, 3, 2, 6, 7, 9, 3};
  std::nth_element(v.begin(), v.begin() + v.size() / 2, v.end());
  // others
  bool is_sorted(ForwardIt first, ForwardIt last);
  void stable_sort(RandomIt first, RandomIt last);
</pre>
</div>
</div>
</div>
<div id="outline-container-orge8f2155" class="outline-2">
<h2 id="orge8f2155"><span class="section-number-2">6.</span> Binary search operations (on sorted ranges)</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-c++">  bool binary_search(ForwardIt first, ForwardIt last, const T &amp;value);
  // the first that is no less than
  ForwardIt lower_bound(ForwardIt first, ForwardIt last, const T &amp;value);
  // the first that is greater than
  ForwardIt lower_bound(ForwardIt first, ForwardIt last, const T &amp;value);
  // range containing all elements equivalent to value
  std::pair&lt;ForwardIt,ForwardIt&gt;
    equal_range( ForwardIt first, ForwardIt last, const T&amp; value );
</pre>
</div>
</div>
</div>
<div id="outline-container-org6251f26" class="outline-2">
<h2 id="org6251f26"><span class="section-number-2">7.</span> Set operations (on sorted ranges)</h2>
<div class="outline-text-2" id="text-7">
<p>
just copy
</p>
<div class="org-src-container">
<pre class="src src-c++">  OutputIt merge(InputIt1 first1, InputIt1 last1,
                 InputIt2 first2, InputIt2 last2, OutputIt d_first);
  void inplace_merge(BidirIt first, BidirIt middle, BidirIt last);
  // if [first1, last1) includes all elms in [first2, last2)
  bool includes(InputIt1 first1, InputIt1 last1, InputIt2 first2, InputIt2 last2);
  // [first1, last1) - [first2, last2)
  OutputIt set_difference(InputIt1 first1, InputIt1 last1,
                          InputIt2 first2, InputIt2 last2, OutputIt d_first);
  // [first1, last1) &amp; [first2, last2)
  OutputIt set_intersection(InputIt1 first1, InputIt1 last1,
                            InputIt2 first2, InputIt2 last2, OutputIt d_first);
  // in either of the ranges, but not in both of them
  OutputIt set_symmetric_difference(InputIt1 first1, InputIt1 last1,
                                    InputIt2 first2, InputIt2 last2,
                                    OutputIt d_first);
  // in both, without duplicates
  OutputIt set_union(InputIt1 first1, InputIt1 last1,
                     InputIt2 first2, InputIt2 last2, OutputIt d_first);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb21b84b" class="outline-2">
<h2 id="orgb21b84b"><span class="section-number-2">8.</span> Heap operations</h2>
<div class="outline-text-2" id="text-8">
<p>
the default is a max heap
</p>
<div class="org-src-container">
<pre class="src src-c++">  bool is_heap(RandomIt first, RandomIt last);
  void make_heap(RandomIt first, RandomIt last);
  // insert the elem at last-1 into the max heap [first, last-1)
  void push_heap(RandomIt first, RandomIt last);
  // that elem is at position last-1 now
  void pop_heap(RandomIt first, RandomIt last);
  // max heap to sorted range
  void sort_heap(RandomIt first, RandomIt last);
</pre>
</div>
</div>
</div>
<div id="outline-container-org61ecf35" class="outline-2">
<h2 id="org61ecf35"><span class="section-number-2">9.</span> Minimum/maximum operations</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-c++">  const T &amp;max(const T &amp;a, const T &amp;b);
  T max(std::initializer_list&lt;T&gt; ilist);
  ForwardIt max_element(ForwardIt first, ForwardIt last);

  std::pair&lt;const T &amp;, const T &amp;&gt; minmax(const T &amp;a, const T &amp;b);
  std::pair&lt;T, T&gt; minmax(std::initializer_list&lt;T&gt; ilist);
  std::pair&lt;ForwardIt, ForwardIt&gt; minmax_element(ForwardIt first, ForwardIt last);
</pre>
</div>

<p>
string/list compasion
</p>
<div class="org-src-container">
<pre class="src src-c++">  bool lexicographical_compare(InputIt1 first1, InputIt1 last1,
                               InputIt2 first2, InputIt2 last2);
</pre>
</div>

<p>
permutation
</p>
<div class="org-src-container">
<pre class="src src-c++">  // if [first1, last1) is a permutation of [first2,last2)
  bool is_permutation(ForwardIt1 first1, ForwardIt1 last1, ForwardIt2 first2);

  bool next_permutation(BidirIt first, BidirIt last);
  bool prev_permutation(BidirIt first, BidirIt last);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd9b7b2a" class="outline-2">
<h2 id="orgd9b7b2a"><span class="section-number-2">10.</span> Numeric operations (&lt;numeric&gt;)</h2>
<div class="outline-text-2" id="text-10">
<p>
range()
</p>
<div class="org-src-container">
<pre class="src src-c++">  std::list&lt;int&gt; l(10);
  std::iota(l.begin(), l.end(), -4);
  // -4 -3 -2 -1 0 1 2 3 4 5
</pre>
</div>

<p>
sum()
</p>
<div class="org-src-container">
<pre class="src src-c++">  T accumulate(InputIt first, InputIt last, T init);
</pre>
</div>

<p>
inner_product, adjacent_difference, partial_sum
</p>
</div>
</div>
<div id="outline-container-orgf262184" class="outline-2">
<h2 id="orgf262184"><span class="section-number-2">11.</span> C library (&lt;cstdlib&gt;)</h2>
<div class="outline-text-2" id="text-11">
<ol class="org-ol">
<li>ptr - pointer to the array to sort</li>
<li>count - number of elements in the array</li>
<li>size - size of each element in the array in bytes</li>
<li>comp - comparison function which returns ​a
<b>negative integer value if the first argument is less than the second</b>,
<b>a positive integer value if the first argument is greater than the second</b>
<b>and zero if the arguments are equal</b>.</li>
</ol>

<div class="org-src-container">
<pre class="src src-c++">  void qsort(void *ptr, std::size_t count, std::size_t size,
             int (*comp)(const void *, const void *));

  int a[] = {-2, 99, 0, -743, 2, INT_MIN, 4};
  constexpr std::size_t size = sizeof a / sizeof *a;

  std::qsort(a, size, sizeof *a, [](const void *a, const void *b) {
    int arg1 = *static_cast&lt;const int *&gt;(a);
    int arg2 = *static_cast&lt;const int *&gt;(b);
    if (arg1 &lt; arg2) return -1;
    if (arg1 &gt; arg2) return 1;
    return 0;
    // return (arg1 &gt; arg2) - (arg1 &lt; arg2); // possible shortcut
    // return arg1 - arg2; // erroneous shortcut (fails if INT_MIN is present)
  });
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++">  void *bsearch(const void *key, const void *ptr, std::size_t count,
                std::size_t size, int (*comp)(const void *, const void *));

  const int SIZE = 8; int key1 = 4;
  int arr[SIZE] = {1, 2, 3, 4, 5, 6, 7, 8};
  int *p1 = (int *)std::bsearch(&amp;key1, arr, SIZE, sizeof(arr[0]), compare);
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: scturtle</p>
<p class="date">Created: 2023-06-14 Wed 17:59</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>